{
  "url": "https://api.github.com/repos/facebook/react/issues/10130",
  "repository_url": "https://api.github.com/repos/facebook/react",
  "labels_url": "https://api.github.com/repos/facebook/react/issues/10130/labels{/name}",
  "comments_url": "https://api.github.com/repos/facebook/react/issues/10130/comments",
  "events_url": "https://api.github.com/repos/facebook/react/issues/10130/events",
  "html_url": "https://github.com/facebook/react/issues/10130",
  "id": 241553434,
  "node_id": "MDU6SXNzdWUyNDE1NTM0MzQ=",
  "number": 10130,
  "title": "Support inheritance",
  "user": {
    "login": "sassanh",
    "id": 1270688,
    "node_id": "MDQ6VXNlcjEyNzA2ODg=",
    "avatar_url": "https://avatars1.githubusercontent.com/u/1270688?v=4",
    "gravatar_id": "",
    "url": "https://api.github.com/users/sassanh",
    "html_url": "https://github.com/sassanh",
    "followers_url": "https://api.github.com/users/sassanh/followers",
    "following_url": "https://api.github.com/users/sassanh/following{/other_user}",
    "gists_url": "https://api.github.com/users/sassanh/gists{/gist_id}",
    "starred_url": "https://api.github.com/users/sassanh/starred{/owner}{/repo}",
    "subscriptions_url": "https://api.github.com/users/sassanh/subscriptions",
    "organizations_url": "https://api.github.com/users/sassanh/orgs",
    "repos_url": "https://api.github.com/users/sassanh/repos",
    "events_url": "https://api.github.com/users/sassanh/events{/privacy}",
    "received_events_url": "https://api.github.com/users/sassanh/received_events",
    "type": "User",
    "site_admin": false
  },
  "labels": [

  ],
  "state": "closed",
  "locked": false,
  "assignee": null,
  "assignees": [

  ],
  "milestone": null,
  "comments": 19,
  "created_at": "2017-07-09T20:16:29Z",
  "updated_at": "2017-08-04T11:46:54Z",
  "closed_at": "2017-07-10T08:12:34Z",
  "author_association": "CONTRIBUTOR",
  "body": "I recall discussing about supporting inheritance for React components here, but unfortunately I can't find the discussion with github's search.\r\n\r\nI know most of React's repository owners are functional programming lovers and I respect it. But there are other people who think while functional programming is good for many usecases, it's not best approach for every use case. Please don't ask me \"what's your use case?\" and try to handle it in your own way. I prefer to code in my own way and I do it fine, never had any problems with scalability/readability/maintainability/extendibility of my code over past 16 years. At least I never chose php for building web servers and then try to change php itself, even though my websites were much smaller than Facebook.\r\n\r\nAnother thing is that when you open source a great library like React, considering its huge user base, you should also take responsibility for all those users relation to your work. And those who respect people, don't force things to them. We expect our politicians to follow this rule, but we should also follow it when we're in a place that we make decisions that affect many others. We hate it when politicians use media to brainwash people and raise votes with populistic methods, I strongly believe React developers unconsciously and out of excitement did the same thing while they were advertising functional programming and things like Redux. So there's no wonder that if you make a poll today and \"ask how many agree that we should support some basics of OO too?\" most won't vote for it.\r\n\r\nAnother thing is that while a framework that forces a specific coding style may be a good framework, the one that doesn't force any coding style or avoids forcing as much as possible is much better.\r\n\r\nAnother thing is that while I agree with all the problems you described here and there about inheritance, there are usecases when none of those problems apply and natural thing to do is using inheritance.\r\n\r\nI just can't believe all the trouble I went through past year just because React doesn't support inheritance. Many many times I reached to the point that I should stop doing frontend project till JS supports compiling python or C++ and browsers run it and people from those communities who still do their projects with OO come and write some good frameworks for Frontend developers.\r\n\r\nI bet while reading this you're tempted to respond with \"please just describe your usecase so that we tell you how to do it without inheritance and stop complaining\" but believe me, you should avoid asking such questions. If I wanted to  ask \"how to do it with composition\" I'd ask so. I know how to do it with composition but it just doesn't make sense as much as doing it with inheritance.\r\n\r\nSo I'm here to ask please support inheritance in React.\r\n\r\nJust remember all the dirty full of parentheses code people were writing before you add support for classes in React. You said you did so just to improve code readability. Ok, now lets support inheritance to bring more readability to codes written with React.\r\n\r\nDefault values set in a class and inherited to its subclasses and still changeable by its subclasses can be done with passing props to a Component you compose in your render method. But sometimes it's just makes more sense to simply inherit, sometimes passing callback as props and taking care of it is just extra work for no gain.\r\n\r\nDisclaimer: I like many many others do appreciate all the good things you did in React, my aggression is just a natural reaction to your passive aggression with forcing others to do things the way you prefer and all your \"explain your problem, we'll tell you how to solve it our way\" responses and all the troubles I had to adopt to your patterns, the patterns you force with your framework.\r\n\r\nBtw I took time and wrote this just to improve React.js,",
  "closed_by": {
    "login": "sassanh",
    "id": 1270688,
    "node_id": "MDQ6VXNlcjEyNzA2ODg=",
    "avatar_url": "https://avatars1.githubusercontent.com/u/1270688?v=4",
    "gravatar_id": "",
    "url": "https://api.github.com/users/sassanh",
    "html_url": "https://github.com/sassanh",
    "followers_url": "https://api.github.com/users/sassanh/followers",
    "following_url": "https://api.github.com/users/sassanh/following{/other_user}",
    "gists_url": "https://api.github.com/users/sassanh/gists{/gist_id}",
    "starred_url": "https://api.github.com/users/sassanh/starred{/owner}{/repo}",
    "subscriptions_url": "https://api.github.com/users/sassanh/subscriptions",
    "organizations_url": "https://api.github.com/users/sassanh/orgs",
    "repos_url": "https://api.github.com/users/sassanh/repos",
    "events_url": "https://api.github.com/users/sassanh/events{/privacy}",
    "received_events_url": "https://api.github.com/users/sassanh/received_events",
    "type": "User",
    "site_admin": false
  }
}
